CFDEM/CFDEMcoupling/tutorials/cfdemPimple/ErgunTestMPI/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcatchyFiniteVolume.so");

application     cfdemSolverRhoPimple;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          5e-4;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      2;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   15;

runTimeModifiable yes;

functions
{
    probes
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" ); 
        writeControl    timeStep;
        writeInterval   1; 

        probeLocations
        (
            (0.00001 0 0.0001)
            (0.00001 0 0.05529)
        );
        fields          (p U voidfraction);
    }
}
// ************************************************************************* //
